{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "[EOS]": 5,
      ",": 6,
      ".": 7,
      "?": 8,
      "M": 9,
      "S": 10,
      "a": 11,
      "b": 12,
      "d": 13,
      "e": 14,
      "g": 15,
      "h": 16,
      "i": 17,
      "k": 18,
      "l": 19,
      "m": 20,
      "n": 21,
      "r": 22,
      "s": 23,
      "t": 24,
      "u": 25,
      "y": 26,
      "ü": 27,
      "İ": 28,
      "ı": 29,
      "ş": 30,
      "sı": 31,
      "ası": 32,
      "er": 33,
      "im": 34,
      "lsı": 35,
      "nası": 36,
      "lsın": 37,
      "nasılsın": 38,
      "Mer": 39,
      "Se": 40,
      "ab": 41,
      "bu": 42,
      "der": 43,
      "ek": 44,
      "eş": 45,
      "eder": 46,
      "gü": 47,
      "hab": 48,
      "iy": 49,
      "kü": 50,
      "teş": 51,
      "yiy": 52,
      "İyiy": 53,
      "Merhab": 54,
      "Sen": 55,
      "bugü": 56,
      "ekkü": 57,
      "ederim": 58,
      "teşekkü": 59,
      "İyiyim": 60,
      "Merhaba": 61,
      "bugün": 62,
      "teşekkür": 63
    },
    "merges": [
      [
        "s",
        "ı"
      ],
      [
        "a",
        "sı"
      ],
      [
        "e",
        "r"
      ],
      [
        "i",
        "m"
      ],
      [
        "l",
        "sı"
      ],
      [
        "n",
        "ası"
      ],
      [
        "lsı",
        "n"
      ],
      [
        "nası",
        "lsın"
      ],
      [
        "M",
        "er"
      ],
      [
        "S",
        "e"
      ],
      [
        "a",
        "b"
      ],
      [
        "b",
        "u"
      ],
      [
        "d",
        "er"
      ],
      [
        "e",
        "k"
      ],
      [
        "e",
        "ş"
      ],
      [
        "e",
        "der"
      ],
      [
        "g",
        "ü"
      ],
      [
        "h",
        "ab"
      ],
      [
        "i",
        "y"
      ],
      [
        "k",
        "ü"
      ],
      [
        "t",
        "eş"
      ],
      [
        "y",
        "iy"
      ],
      [
        "İ",
        "yiy"
      ],
      [
        "Mer",
        "hab"
      ],
      [
        "Se",
        "n"
      ],
      [
        "bu",
        "gü"
      ],
      [
        "ek",
        "kü"
      ],
      [
        "eder",
        "im"
      ],
      [
        "teş",
        "ekkü"
      ],
      [
        "İyiy",
        "im"
      ],
      [
        "Merhab",
        "a"
      ],
      [
        "bugü",
        "n"
      ],
      [
        "teşekkü",
        "r"
      ]
    ]
  }
}